% Εκκαθάριση του περιβάλλοντος από προηγούμενες διεργασίες %
clear;clc

% Εισαγωγή των πινάκων του συστήματος %
A=[2 -1 0 0 0;1 2 -1 0 0;0 2 4 -1 0;0 0 0 2 -1;0 0 0 1 2];
d=[1;2;-1;-2;-1];

% Έλεγχος εάν ο πίνακας Α είναι τριδιαγώνιος %
% Εάν ο πίνακας Α δεν είναι τριδιαγώνιος, το πρόγραμμα τερματίζει.
if ~isbanded(A, 1, 1)
error('Ο πίνακας δεν είναι τριδιαγώνιος, επομένως ο αλγόριθμος Thomas δεν μπορεί να εφαρμοστεί.');
end

% Απόσπαση των τριών διαγωνίων του πίνακα σε διανύσματα %
a=diag(A,-1);
b=diag(A);
c=diag(A,1);

% Δημιουργία μηδενικών διανυσμάτων για τα c'(i), d'(i) και x(i) %
c_=zeros(size(c));
d_=zeros(size(d));
x=zeros(size(d));

c_(1)=c(1)/b(1);
d_(1)=d(1)/b(1);

for i=2:(length(b)-1)
    c_(i) = c(i) / (b(i) - a(i-1) * c_(i-1));
end

for i=2:length(b)
    d_(i) = (d(i) - a(i-1) * d_(i-1)) / (b(i) - a(i-1) * c_(i-1));
end

for i=(length(b)-1):-1:1
    x(i)=d_(i)-c_(i)*x(i+1);
end

% Παρουσίαση της λύσης του προβλήματος %
disp('Η λύση του συστήματος βάσει του αλγορίθμου Thomas είναι η εξής:');
disp(x);

% Επιπλέον βήματα
% Βήμα 1: Επαλήθευση για την ορθότητα της λύσης με την εντολή A\d %
% Βήμα 2: Ο υπολογισμός του όρου (b(i) - a(i-1) * c_(i-1)) στο πηλίκο
% μια φορά, καθώς ο όρος αυτός είναι κοινός και στους δύο βρόγχους.