% Εκκαθάριση του περιβάλλοντος από προηγούμενες διεργασίες %
clear;clc

% Εισαγωγή των πινάκων του συστήματος %
A=[10 5 0 0;5 10 -4 0;0 -4 8 -1;0 0 -1 5];
b=[6;25;-11;-11];

% Έλεγχος Διαγώνιας Υπεροχής
n0 = size(A, 1);
for i = 1:n0
    diagsum = sum(abs(A(i,:))) - abs(A(i,i));
    if abs(A(i,i)) <= diagsum
        error(['Ο πίνακας Α δεν έχει αυστηρή διαγώνια υπεροχή. ' ...
        'Να διατυπωθεί διαφορετικά ο πίνακας.'], i);
    end
end

% Αρχικοποίηση Συνθηκών %
x0=[0;0;0;0];
% Ορισμός Σφάλματος & Μέγιστου αριθμού επαναλήψεων%
tol=1e-4;
n=(length(b))^(length(b));

% Παραγοντοποίηση Πίνακα %
D = diag(diag(A));
L = tril(A, -1);
U = triu(A, 1);

% Ορισμός Βοηθητικών Πινάκων %
w=1.1;
R=-L-U;
S=D+L;
T=D+w*L;

% 1. Μέθοδος Jacobi
x = x0;
% Αρχικοποίηση του σφάλματος και του αριθμού επαναλήψεων %
error = inf;
epan = 0;
while error > tol && epan < n
    x = (D\R)*x0 + D\b;
    error = norm(x - x0, inf) / norm(x, inf); % <-- ΑΛΛΑΓΗ ΕΔΩ
    x0=x;
    epan=epan+1;
end
xJ = x;
epanJ = epan; % Αποθήκευση του αριθμού επαναλήψεων

% Μετά από κάθε εφαρμογή, επαναφέρουμε την αρχική τιμή της x0, ούτως ώστε
% να λύσουμε εξαρχής το επόμενο πρόβλημα.
x0=[0;0;0;0];

% 2. Μέθοδος Gauss-Seidel
x = x0;
% Αρχικοποίηση του σφάλματος και του αριθμού επαναλήψεων %
error = inf;
epan = 0;
while error > tol && epan < n
    x = -(S\U)*x0 + S\b;
    error = norm(x - x0, inf) / norm(x, inf); % <-- ΑΛΛΑΓΗ ΕΔΩ
    epan = epan + 1;
    x0=x;
end
xGS = x;
epanGS = epan; % Αποθήκευση του αριθμού επαναλήψεων

x0=[0;0;0;0];
% 3. Μέθοδος Σχετικής Χαλάρωσης
x = x0;
% Αρχικοποίηση του σφάλματος και του αριθμού επαναλήψεων %
error = inf;
epan = 0;
while error > tol && epan < n
    x = T\(-w*U+(1-w)*D)*x0 + w*(T\b);
    error = norm(x - x0, inf) / norm(x, inf); % <-- ΑΛΛΑΓΗ ΕΔΩ
    epan = epan + 1;
    x0=x;
end
xW = x;
epanW = epan; % Αποθήκευση του αριθμού επαναλήψεων

% Επαναφέρουμε την τιμή της x0 στην αρχική της τιμή (για μελλοντική χρήση)
x0=[0;0;0;0];

% Παρουσίαση των αποτελεσμάτων των μεθόδων σε κοινό πίνακα %
all_data = [xJ, xGS, xW; epanJ, epanGS, epanW];
row_labels = {'x(1)', 'x(2)', 'x(3)', 'x(4)', '# επαναλήψεων'};
column_labels = {'Jacobi', 'Gauss_Seidel', 'Relaxation'};
results_table = array2table(all_data, ...
    'RowNames', row_labels, 'VariableNames', column_labels);

if epanJ >= n || epanGS >= n || epanW >= n
    disp('Ο υπολογισμός τερματίστηκε λόγω του αριθμού επαναλήψεων και όχι της σύγκλισης.');
    disp('Η επιλογή μεγίστου στον αριθμό επαναλήψεων πρέπει να επαναληφθεί.');
else
    disp('Ο υπολογισμός τερματίστηκε για όλες τις μεθόδους λόγω σύγκλισης.');
    disp('Η επιλογή μεγίστου στον αριθμό επαναλήψεων ήταν σωστή.');
end
disp(' ');

disp('Τα αποτελέσματα των τριών μεθόδων και ο απαιτούμενος αριθμός επαναλήψεων παρουσιάζονται στον παρακάτω πίνακα:');
disp(' ');
disp(results_table);