% Problem: Επίλυση ελλειπτικών μερικών διαφορικών εξισώσεων
% με πεπερασμένες διαφορές (ελλειπτικό πρόβλημα)
% Αριθμητική Επίλυση Μόνιμης, Πλήρως Ανεπτυγμένης, Στρωτής Ροής σε Σωλήνα
% Input: Διαστάσεις του σωλήνα, Ιδιότητες ρευστού (πυκνότητα &
% συνεκτικότητα), Παροχή

% Εκκαθάριση του περιβάλλοντος από προηγούμενες διεργασίες %\
clear;clc

% Τιμές του προβλήματος
p=870; % Πυκνότητα του ρευστού σε [kg/m^3]
m=0.104; % Συνεκτικότητα του ρευστού σε [kg/ms]
Q=0.17; %Παροχή σε [m^3/s]

a=1; % Μήκος πλευράς της διατομής του σωλήνα σε [m]
b=a; % Τετραγωνική διατομή πλευράς a

% Γενικοί τύποι διαστάσεων ορθογώνιας διατομής
area=a*b; % Το εμβδαδόν διατομής του σωλήνα σε [m^2]
perim=2*(a+b); % Η βρεχόμενη περίμετρος διατομής του σωλήνα σε [m^2]
radius=area/perim; % Η υδραυλική ακτίνα διατομής του σωλήνα σε [m]

% Εισαγωγή αποτελεσμάτων του θεωρητικού υπολογισμού (ίσως βοηθήσει
% στη σύγκριση τους με τα αποτελέσματα της αριθμητικής μεθόδου)
u_avg_theo=Q/area; % Θεωρητική μέση χωρικά ταχύτητα σε [m/s]

% Ο παρακάτω τύπος ισχύει μόνο για τετρ. διατομές οριζόντιων σωλήνων %
slope_theo=-Q*m/(0.035144*a^4); % Κλίση πίεσης σε [Pa/m]2
reynolds_theo=u_avg_theo*a*p/m; % Αριθμός Reynolds (αδιάστατο)
S_theo=a^2*slope_theo/m/u_avg_theo; % Συντελεστής σχήματος (αδιάστατο)

% Ορισμός Σφάλματος & Μέγιστου αριθμού επαναλήψεων (αυθαίρετα) %
tol=1e-4;
n=1e+4; % Μέγιστο όριο αριθμού επαναλήψεων
N=15; % Αριθμός υπολογιστικών κόμβων

% Δημιουργία υπολογιστικού πλέγματος
h=1/N;

% Κατασκευή υπολογιστικού πλέγματος %
x=zeros(1,N);
x(N)=1;
for i=2:N-1
    x(i)=x(i-1)+h;
end
y=x;

u=zeros(N,N);

iter = 0;
error = inf;

while error > tol && iter < n
    u_old = u;
    iter = iter + 1;
    
    for i = 2:N-1
        for j = 2:N-1
            u(i,j) = 0.25 * (u_old(i-1,j) + u_old(i+1,j) + u_old(i,j-1) + u_old(i,j+1) - (h^2) * S_theo);
        end
    end
    
    error = max(max(abs(u - u_old)));
end
clear('u_old');


% Αριθμητική αναπαράσταση των αποτελεσμάτων%
disp ('Ο πίνακας u των τιμών της ταχύτητας υπολογίστηκε ως εξής:')
disp(u);
disp (['Ακολουθεί η γραφική αναπαράσταση των αποτελεσμάτων για τις' ...
    ' τιμές της ταχύτητας.'])

% Γραφική αναπαράσταση των αποτελεσμάτων %
[X, Y] = meshgrid(linspace(0, 1, N));
figure;
mesh(X, Y, u); % Δημιουργεί το έγχρωμο πλέγμα (wireframe)
colormap(cool(5)); % Ορίζει την παλέτα parula με 5 διακριτά επίπεδα χρωμάτων
colorbar;
xlabel('x');
ylabel('y');
zlabel('w');
title(['Γράφημα 1: Κατανομή της συνιστώσας της ταχύτητας κατά μήκος' ...
    ' της κύριας κατεύθυνσης της ροής στη διατομή']);
grid on;
view(45, 30);

figure;
contourf(X, Y, u, 20); % 2D κάτοψη με 20 επίπεδα χρωμάτων
colormap(cool); % Ή 'hot' για να μοιάζει με το screenshot
colorbar;
axis equal; % Διατηρεί τις σωστές αναλογίες της διατομής (τετράγωνο)
xlabel('x');
ylabel('y');
title('Γράφημα 2: Κάτοψη Κατανομής Ταχύτητας');