clear;clc
format short

syms x1 x2 x3
x=[x1;x2;x3];

f = [x1^2 + x2 - 37;
     x1 - x2^2 - 5;
     x1 + x2 + x3 - 3];
j=jacobian(f,x);

% Αρχικοποίηση Συνθηκών %
x0=[0;0;0];
error=inf;
epan=0;
tol=1e-04;
n=(length(x0))^(length(x0));

while error > tol && epan < n
    f0 = subs(f, x, x0);
    j0 = subs(j, x, x0);
    
    s=-j0\f0;
    x_=x0+s;
    error = norm(x_ - x0, inf);
    x0=x_;
    epan=epan+1;
end

% Επαλήθευση της παρατήρησης στην εκφώνηση περί σύγκλισης %
if epan < n
    disp('Ο υπολογισμός τερματίστηκε λόγω σύγκλισης. Η επιλογή μεγίστου στον αριθμό επαναλήψεων ήταν σωστή.');
else
    disp('Ο υπολογισμός τερματίστηκε λόγω του αριθμού επαναλήψεων και όχι της σύγκλισης. Η επιλογή μεγίστου στον αριθμό επαναλήψεων πρέπει να επαναληφθεί.');
end
disp(' ');
% Παρουσίαση της λύσης του προβλήματος %
disp('Η λύση του συστήματος βάσει του αλγορίθμου Newton-Raphson είναι η εξής:');
disp(double(x_));