% Problem: Πρόβλημα Οριακών Τιμών με ΣΔΕ: 
% Αριθμητική Επίλυση Μόνιμης, Πλήρως Ανεπτυγμένης, Στρωτής Ροής σε Σωλήνα
% Input: Διάμετρος του σωλήνα, Ιδιότητες ρευστού (πυκνότητα &
% συνεκτικότητα), Παροχή, Αριθμός Υπολογιστικών Κόμβων
% Expected Output: Διάγραμμα ταχύτητας κατά μήκος του άξονα του σωλήνα
% Extra: Σύγκριση των δύο υπολογισμών της μέσης ταχύτητας που προκύπτουν
% θεωρητικά και αριθμητικά

% Εκκαθάριση του περιβάλλοντος από προηγούμενες διεργασίες %\
clear;clc

% Τιμές του προβλήματος
d=1; % Μήκος διαμέτρου της διατομής του σωλήνα σε [m]
area=pi*(d/2)^2; % Το εμβδαδόν διατομής του σωλήνα σε [m^2]
p=870; % Πυκνότητα του ρευστού σε [kg/m^3]
m=0.104; % Συνεκτικότητα του ρευστού σε [kg/ms]
Q=0.16; %Παροχή σε [m^3/s]

% Εισαγωγή αποτελεσμάτων του θεωρητικού υπολογισμού (ίσως βοηθήσει
% στη σύγκριση τους με τα αποτελέσματα της αριθμητικής μεθόδου)
u_avg_theo=Q/area; % Θεωρητική μέση χωρικά ταχύτητα σε [m/s]
slope_theo=-(8*m*u_avg_theo)/(d/2)^2; % Κλίση πίεσης σε [Pa/m]
reynolds_theo=u_avg_theo*d*p/m; % Αριθμός Reynolds (αδιάστατο)

N=input(['Εισαγάγετε # υπολογιστικών κόμβων για την επίλυση με ' ...
    'αλγόριθμο Thomas: ']);

% Υπολογισμός διαστήματος διαμέρισης dr %
dr=1/(N-1);

% Κατασκευή υπολογιστικού πλέγματος %
r=zeros(1,N);
r(N)=1;
for i=2:N-1
    r(i)=r(i-1)+dr;
end

% Δημιουργία αρχικών διανυσμάτων για τα A(i), B(i), C(i), D(i) % 
A=zeros(1,N);
B=-2*ones(1,N);
C=zeros(1,N);
D=(-8*(dr)^2)*ones(1,N);

% Υπολογισμός των A(i), B(i), C(i), D(i) %
for i=2:N-1
    A(i)=1-dr/(2*r(i));
    C(i)=1+dr/(2*r(i));
end

% Συνοριακές συνθήκες %
% 1. Συνθήκη Neumann στο κέντρο  της διατομής (μηδενική παράγωγος της
% ταχύτητας στο σημείο i=1)
A(1) = 0;
B(1) = 1;
C(1) = -1;
D(1) = 0;
% 2. Συνθήκη Dirichlet στο τοίχωμα (μηδενική ταχύτητα στο σημείο i=N) %
A(N) = 0;
B(N) = 1;
C(N) = 0;
D(N) = 0;

% Υλοποίηση του αλγορίθμου Thomas (βάσει της λύσης της Άσκησης 1.1) %
C(1) = C(1) / B(1);
D(1) = D(1) / B(1);

for i = 2:N
    temp = B(i) - A(i) * C(i-1);
    C(i) = C(i) / temp;
    D(i) = (D(i) - A(i) * D(i-1)) / temp;
end

u = zeros(1,N);
u(N) = D(N);

for i = N-1:-1:1
    u(i) = D(i) - C(i) * u(i+1);
end

% Διάγραμμα αδιάστατων ακτινών και ταχυτήτων %
figure;
plot(r, u, 'LineWidth', 2);
xlabel('Αδιάστατη Ακτίνα r');
ylabel('Αδιάστατη Ταχύτητα u');
grid on;

u_avg_num = (Q / (pi*(d/2)^2)) * 2 * trapz(r, u .* r);

if abs(u_avg_num-u_avg_theo)<1e-04
    disp(['Οι τιμές του θεωρητικού και του αριθμητικού υπολογισμού' ...
        ' ταυτίζονται. Η τιμή της μέσης ταχύτητας είναι ίση με:'])
    disp(u_avg_theo);
else
    disp(['Οι τιμές του θεωρητικού και του αριθμητικου υπολογισμού' ...
        ' δεν ταυτίζονται. Η θεωρητική τιμή είναι ίση με:'])
    disp(u_avg_theo);
    disp('ενώ η αριθμητική τιμή είναι ίση με:')
    disp(u_avg_num);
end